# ReactionsAreUpToDate Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Document..::..ReactionsAreUpToDate Property
Document Class See Also
---
Reports if the analytical model has regenerated in a document with reaction loads.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool ReactionsAreUpToDate { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ReactionsAreUpToDate As Boolean
	Get
```

Visual C++
---
```text
public:
property bool ReactionsAreUpToDate {
	bool get ();
}
```

# Remarks
Revit sets this property to False after regeneration of the analytical model if the document contains loads that have isReaction=True. This results in a user-visible warning that exists until there are no longer loads with isReaction=True.
# See Also
Document Class
Autodesk.Revit.DB Namespace